<ol class="numeric">
    <li>
        Принятие положения Администрации.
        <ol class="numeric">
            <li>
                Администрация Solaris является верховным органом власти на проекте.
            </li>
            <li>
                Администрация Solaris оставляет за собой право менять внешний вид сайта, либо конкретного магазина, редактировать, удалять, переносить медиафайлы, текстовые изображения и другую информацию.
            </li>
            <li>
                Администрация Solaris оставляет за собой право прекратить деятельность учетной записи покупателя или магазина в случаях предусмотренными правилами площадки или за их нарушение.
            </li>
            <li>
                Администрация имеет право собирать статистические данные своих пользователей, сохраняя при этом их фактическую анонимность.
            </li>
            <li>
                Администрация использует деловой жанр речи в переписках со своими пользователями, призывая последних также придерживаться его.
            </li>
            <li>
                Перед правилами равны все. Амнистию могут осуществлять только Администраторы.
            </li>
            <li>
                Запрещено размещаться на ресурсах, которые находятся в черном списке Solaris, проявляют агрессию или атаки в нашу сторону. Или по мнению администрации предоставляют угрозу нашему сообществу.
                <br>
                Список: RuTor / OMG. За размещение предусмотрены серьезные санкции.
            </li>
            <li>
                На ресурсе запрещено продавать:
                <ul>
                    <li>
                        Яды и радиоактивные вещества.
                    </li>
                    <li>
                        Услуги по DDOS-атакам, вирусный софт и другие IT-предложения которыми не занимается наш ресурс.
                    </li>
                    <li>
                        Производные реагентов JWH, готовые курительные смеси с синтетическими каннабиноидами и их аналогами, известные как «спайсы».
                    </li>
                    <li>
                        Аккаунты других даркнет-площадок.
                    </li>
                    <li>
                        Любые виды оружия.
                    </li>
                    <li>
                        Политическую информацию или данные о политиках, информацию составляющую гос. тайну любой страны.
                    </li>
                    <li>
                        Детскую порнографию или другие фото/видео материалы носящие эротический или порнографический характер с изображением несовершеннолетних лиц.
                    </li>
                    <li>
                        Любые производные фентанила.
                    </li>
                </ul>
            </li>
            <li>
                Запрещено рекламировать или вести деятельность по обналичиванию или обмену ассигнаций, криптовалют или других ценных бумаг/активов без предварительного согласования с Администрацией.
            </li>
            <li>
                Администрация не занимается восстановлением утраченных или взломанных аккаунтов к которым не был привязан PGP ключ.
            </li>
            <li>
                Администрация в праве осуществлять контроль деятельности магазинов, участвовать в проблемных заказах, выносить свое окончательное решение по проблемным ситуациям.
            </li>
            <li>
                Запрещено любое упоминание - предоставление информации и\или ссылок - иных ресурсов схожей с Solaris тематики.
            </li>
        </ol>
    </li>
    <li>
        Правила для Продавцов.
        <ol class="numeric">
            <li>
                Для открытия магазину необходимо пройти проверку у Администрации, а именно: предоставить фото товара, рядом листок бумаги с написанным на нем названием магазина и ссылкой на каталог Solaris.
            </li>
            <li>
                Продавец имеет право начать осуществлять торговую деятельность сразу после получения своего магазина и заполнения всей торговой информации, которая включает в себя: подробное описание товаров или услуг, их цен (в рублях), особенностей работы, правил и положений магазина, графика работы продавца. Данная информация должна быть актуальна и подлежать своевременному обновлению в случае её изменения.
                Правила магазины не могут быть выше/противоречить/обходить правила каталога Solaris.
            </li>
            <li>
                Запрещено раскрывать личные данные пользователей без их согласия.
            </li>
            <li>
                Запрещена продажа одного товара под видом другого, что именуется как "подмена товара". За первичное нарушение штраф, за повторное бан.
            </li>
            <li>
                Запрещено установление связи между покупателем и продавцом в обход торговой площадки (Пример - предоставить свои контакты в различных мессенджерах), иными словами, обмен контактными данными, кроме отдельных случаев, одобренных администрацией площадки.
            </li>
            <li>
                Продавцам запрещается совершать продажу товара или услуг в обход торговой системы с покупателями трафик которых предоставляется каталогом Solaris.
            </li>
            <li>
                Запрещен любой вид спама/флуда в ЛС.
            </li>
            <li>
                В личных сообщениях, обсуждениях запрещается грубая ненормативная лексика и неадекватное поведение.
            </li>
            <li>
                Запрещается добавлять на витрину лотереи, либо иным способом накручивать отзывы с целью повышения рейтинга или количества фактических сделок.
            </li>
            <li>
                Отказ от выплаты штрафа(ов) приведет к блокировке магазина.
            </li>
            <li>
                Продажа магазинов возможна только при согласовании с администрацией и оплаты квот. Для продажи своего магазина, нужно создать соответствующий тикет и указать причину, а также соответствовать следующим показателям:
                <ol>
                    <li>
                        В магазине должно быть не меньше 1.000 сделок. Каждая сделка оценивается в 10 рублей.
                    </li>
                    <li>
                        Каждый работающий курьер магазина оценивается в 50.000 рублей, даже если его залог меньше.
                    </li>
                    <li>
                        Каждый открытый город, с населением до 100.000 человек оценивается в 25.000 рублей.
                    </li>
                    <li>
                        Каждый открытый город с населением от 100.000 до 300.000 человек оценивается в 50.000 рублей.
                    </li>
                    <li>
                        Каждый открытый город с населением 300.000 до 500.000 человек оценивается в 100.000 рублей.
                    </li>
                    <li>
                        Каждый открытый город от 500.000 человек и больше оценивается в 250.000 рублей
                    </li>
                    <li>
                        Санкт-Петербург и Москва оценивается в 500.000 рублей.
                    </li>
                    <li>
                        Магазин перед продажей должен закрыть все обязательства перед контрагентами и своими сотрудниками.
                    </li>
                </ol>
            </li>
            <li>
                Магазин полностью несёт ответственность за своих партнеров и в случае ущерба нанесенного партнером, компенсирует его в двойном размере. Магазин несет полную ответственность не только за партнеров, но и за сотрудников.
            </li>
            <li>
                Запрещено принимать на работу несовершеннолетних.
            </li>
            <li>
                Запрещено намеренное дублирование адресов в магазине, за что полагается штраф. Если магазин самостоятельно обнаружил, что по случайности был добавлен двойной адрес, и исправил это, то он освобождается от ответственности.
            </li>
            <li>
                Магазины, которые не следят за своей витриной и не ведут деятельность на протяжении 2-х месяцев будут удалены. Все балансы аннулируются.
            </li>
            <li>
                Запрещено делать клады на территории силовых структур любого уровня, детских садов, школ и других образовательных учреждений, которые могут посещать несовершеннолетние лица. Расстояние от клада до запрещенной локации должно быть более или равно 30 метрам, за исключением случаев когда между кладом и локацией находится автомобильная дорога (под автомобильной дорогой понимается асфальтированная дорога имеющая минимум 2 полосы, разметку и пешеходный переход), дороги придомовой территории и парковки не считаются автомобильной дорогой. Также нарушением правил будет считаться размещение клада рядом с пешеходным переходом ведущему к локации и находящемуся в радиусе 30 метров от локации (пример: единственный пешеходный переход к детсаду и клад сделан в клумбе возле него). Соседние подъезды с рядом с запрещенной локацией, в случае если локация не имеет отдельностоящего здания также являются её территорией (пример: участковый пункт полиции находится в подъезде номер 1, а клад сделан в подъезде номер 2, в таком случае правило будет считаться нарушенным).
            </li>
            <li>
                Категорически запрещена продажа товаров которые попадают в список пункта правил 1.8 и 1.9.
            </li>
            <li>
                Запрещена продажа товаров, которые есть в открытом доступе, получение которых не составляет труда для обычного пользователя.
            </li>
            <li>
                Запрещается двойное размещение, описанное в пункте правил 1.7.
            </li>
            <li>
                Магазин сам решает проблемные ситуации с покупателем, не имеет права оставлять проблемные заказы без внимания, обязан в течении 24 часов давать обратную связь по проблемным заказам / проводить анализ ситуации / находить решения. В случае обращения Клиентом к Модераторам Solaris, Модераторы проводят дополнительную проверку проблемной ситуации и выносят окончательное решение. Магазины не вправе оспаривать решение Модераторов. Решение Модератора является утвердительным и окончательным.
            </li>
            <li>
                Запрещается размещать карточки товаров в не соответствующих категориях, что приводит к бардаку в каталоге.
            </li>
            <li>
                Если в рамках проведения акции SolarisQuality будет установлен недовес, ненаход, или качество не будет соответствовать заявленным, на магазин будут наложены штрафные санкции, а карточка товара может быть удалена.
            </li>
            <li>
                Запрещено оскорблять покупателя, угрожать ему физической расправой или шантажировать.
            </li>
        </ol>
    </li>
    <li>
        Правила для Покупателей.
        <ol class="numeric">
            <li>
                Приобретая товар у магазина, Вы соглашаетесь с его правилами торговли и принимаете политику магазина. Правила магазины не могут быть выше/противоречить/обходить правила каталога Solaris.
            </li>
            <li>
                Категорически запрещены ссылки на сторонние ресурсы или страницы социальных сетей, электронные почты, номера мобильных телефонов.
            </li>
            <li>
                Категорически запрещен спам, флейм, флуд в отзывах, а также отзывы, которые не имеют никакого смысла.
            </li>
            <li>
                Запрещено использование ПО, которое может нанести вред как торговой площадке, так и её пользователям.
            </li>
            <li>
                Запрещена деанонимизация пользователей под каким бы то ни было предлогом, и по какой бы то ни было причине.
            </li>
            <li>
                Запрещена скрытая реклама или постинг с целью открытой рекламы.
            </li>
            <li>
                Покупатель имеет право опубликовать отзыв в течение 24 часов и дополнить его в течение 46 часов.
            </li>
            <li>
                В случае проблем с заказом, покупатель самостоятельно решает проблему с продавцом. Работы над системой гаранта-модератора уже ведутся.  Если в течении 48 часов магазин не будет принимать объективных решений согласно полному анализу ситуации, Покупатель в праве написать тикет с предоставлением всей доказательной базы по игнорированию или отсутствия попыток рассмотреть проблемную ситуации со стороны магазина.
            </li>
            <li>
                В личных сообщениях, не приветствуется ненормативная лексика и неадекватное выражение своих мыслей понятное только автору. Агрессия и мат могут привести к блокировке. Публичные сообщения нецензурной формы могут быть удалены без предупреждения.
            </li>
            <li>
                Сделки проведенные в ЛС и/или в обход площадки не подлежат обжалованию и какому-либо рассмотрению. Помните об этом и не совершайте ошибки, когда хотите сэкономить 1-2 % на сумме. В прямом смысле такие сделки разбираться не будут и вы останетесь с проблемой один на один, а обидчик с вашими деньгами.
            </li>
        </ol>
    </li>
    <li>
        Штрафы и санкции.
        <ol class="numeric">
            <li>
                Нарушение пункта правил 1.7 приведет к блокировке и списанию всех активов и удаления из каталога Solaris, без возможности вернуться. Ведется учет и контроль нарушителей.
            </li>
            <li>
                Нарушение пункта правил 1.8 наказывается штрафом от 50.000 рублей до 5.000.000 рублей, на усмотрение администрации, а также безвозвратным удалением карточки товара.
            </li>
            <li>
                Нарушение пункта правил 1.9 наказывается штрафом в размере до 10.000.000 рублей, при повторном нарушении магазин будет удалён.
            </li>
            <li>
                Нарушение пункта правил 2.3 наказывается штрафом в размере 100.000 рублей.
            </li>
            <li>
                Нарушение пункта правил 2.4 наказывается штрафом в размере 100.000 рублей, при повторном нарушении штраф будет расти в геометрической прогрессии.
            </li>
            <li>
                Нарушение пункта правил 2.5 наказывается штрафом в размере 500.000 рублей.
            </li>
            <li>
                Нарушение пункта правил 2.6 наказывается штрафом в размере 1.000.000 рублей.
            </li>
            <li>
                Нарушение пункта правил 2.7 наказывается штрафом в размере 50.000 рублей.
            </li>
            <li>
                Нарушение пункта правил 2.8 или 3.9 может обернуться заморозкой аккаунта от двух часов до недели.
            </li>
            <li>
                Нарушение пункта правил 2.9 наказывается штрафом в 200.000 рублей и обнулением счетчика продаж / удалением накрученной позиции.
            </li>
            <li>
                Нарушение пункта правил 2.14 наказывается штрафом для магазинов с количеством сделок:
                До 500 сделок предупреждение, либо штраф 25.000 рублей.
                От 500 сделок до 1.000 штук, предупреждение либо штраф 35.000 рублей.
                От 1.000 сделок и выше - 50.000 рублей.
            </li>
            <li>
                Нарушение пункта правил 2.16 наказывается штрафом для магазинов с количеством сделок:
                До 500 сделок предупреждение, либо штраф 25.000 рублей.
                От 500 сделок до 1.000 штук, предупреждение либо штраф 35.000 рублей.
                От 1.000 сделок и выше - 50.000 рублей.
            </li>
            <li>
                Нарушение пункта 3.2 - 3.6 приведет к блокировке аккаунта.
            </li>
            <li>
                Нарушение пункта правил 2.21 наказывается штрафом в 50.000 рублей за каждую карточку не в своей категории.
            </li>
            <li>
                Нарушение пункта правил 2.20 наказывается штрафом в размере 100.000 рублей. Данный пункт считается нарушенным при попытке отказа выполнить решение Модератора, что может повлечь за собой полную блокировку магазина.
            </li>
            <li>
                Нарушение пункта правил 2.22 наказывается штрафом на усмотрение Службы Безопасности или без такового.
            </li>
            <li>
                Нарушение пункта 2.23 наказывается штрафом в размере 25.000 рублей при повторном нарушении размер штрафа увеличивается в два раза.
            </li>
            <li>
                Нарушения пункта правил 2.6.1 наказывается штрафом в двойном размере от суммы сделки. Покупатель сообшивший об этом получает 50 % от суммы штрафа.
            </li>
            <li>
                Нарушение пункта 1.12 наказывается штрафом в размере 150.000 рублей. При повторном нарушении сумма штрафа выставляется на усмотрение Службы Безопасности, но не менее 300.000 рублей.
            </li>
        </ol>
    </li>
</ol>
<hr />
<h3>Термины и обозначения.</h3>
<br/>
<b>VHQ - "Very High Quality"</b> / качество товара должно быть равным или выше 97,5 % чистоты образца.<br/>
<b>HQ - "High Quality"</b> / качество товара должно быть равным или выше 94 % чистоты образца.<br/>
<b>MQ - "Medium Quality"</b> / качество товара должно быть выше 80 % чистоты образца.<br/>
<b>LQ - "Low Quality"</b> / качество товара должно быть выше 50 % чистоты образца.<br/>
<br/>
<b>Кристалл (Роксы)</b> - это твердая структура и форма вещества, которая имеет грани видные не вооруженным глазом.<br/>
<b>Пудра</b> - мелкодисперсная структура вещества, которая имеет признаки кристалла, но при этом является по физическим свойствам ближе к муке.<br/>
<b>Мука</b> - порошкообразное вещество, которое напоминает внешним видом пищевую муку.<br/>