@extends('layouts.master')

@section('title', 'Рекламодателям')

@section('content')
    <div class="row">
        <div class="col-xs-24 animated fadeIn">
            <div class="well block">
                <h2>Рекламодателям</h2>
                <hr class="small" />
                <p>Приглашаем к сотрудничеству рекламодателей.</p>
                <p>Мы имеем богатый опыт работы и готовы щедро оплачивать следующие направления:</p>

                <ul>
                    <li>Спам (Не менее 150.000 сообщений в час).</li>
                    <li>Таргетированная реклама.</li>
                    <li>Скрытая реклама.</li>
                    <li>Реклама в соц сетях.</li>
                    <li>Реклама в пабликах и группах (Аудитория не менее 25.000 человек).</li>
                    <li>Крупные рекламные баннеры на билбордах, проходных местах.</li>
                    <li>Рассылки и прозвоны по номерам телефонов.</li>
                </ul>
            </div>
        </div>
    </div>
@endsection