<h3>Markdown</h3>
<hr class="small" />
<div class="row">
    <div class="col-sm-12">
        <pre>Заголовок первого уровня
============

Заголовок второго уровня
------------

### Заголовок третьего уровня ###

***

Текст с выделением и логическим ударением:

*Курсив*, **жирный**, и `моноширинный`.

***

Cписки:
Детализированный список:
* Красный
* Зеленый
* Синий

Нумерованный список:
1. Синий
2. Зеленый
3. Красный

Вложенный список:
1. Нам нужны следующие цвета:

* красный
* зеленый
* синий

2. Остальные не нужны.

***
Цитаты:

> Блочные цитаты
> выглядят так
>
> Они могут охватывать несколько абзацев,
> если вам это потребуется

~~~
Еще цитаты могут выглядеть так
~~~

***
Разделитель:
***

Таблицы:

Заголовок 1  |  Заголовок 2
-------- | --------
клетка 1.1 | клетка 1.2
клетка 2.1 | клетка 2.2

***

Гиперссылки:

Вот как выглядит [гиперссылка](https://ru.wikipedia.org/wiki/Markdown)

***

Изображения:

![alt-текст](http://i.imgur.com/i3Q2oHx.jpg?1 "Этот текст выводится при наведении мышки на картинку")</pre>
    </div>
    <div class="col-sm-12">
        <div class="markdown-content">
        @markdown
        Заголовок первого уровня
        ============

        Заголовок второго уровня
        ------------

        ### Заголовок третьего уровня ###

        ***
        Текст с выделением и логическим ударением:

        *Курсив*, **жирный**, и `моноширинный`.
        ***

        Cписки:
        Детализированный список:
        * Красный
        * Зеленый
        * Синий

        Нумерованный список:
        1. Синий
        2. Зеленый
        3. Красный

        Вложенный список:
        1. Нам нужны следующие цвета:

        * красный
        * зеленый
        * синий

        2. Остальные не нужны.

        ***
        Цитаты:

        > Блочные цитаты
        > выглядят так
        >
        > Они могут охватывать несколько абзацев,
        > если вам это потребуется

        ~~~
        Еще цитаты могут выглядеть так
        ~~~
        ***
        Разделитель:
        ***
        Таблицы:

        Заголовок 1  |  Заголовок 2
        -------- | --------
        клетка 1.1 | клетка 1.2
        клетка 2.1 | клетка 2.2
        ***
        Гиперссылки:

        Вот как выглядит [гиперссылка ](https://ru.wikipedia.org/wiki/Markdown)
        ***
        Изображения:

        ![alt-текст](http://i.imgur.com/i3Q2oHx.jpg?1 "Этот текст выводится при наведении мышки на картинку")
        @endmarkdown
        </div>
    </div>
</div>