<?php
return [
    'Error 403' => 'Ошибка 403',
    'Error 404' => 'Error 404',
    'Error 500' => 'Error 500',
    'You are not authorized' => 'У вас нет прав для просмотра данной страницы.',
    'Page not found' => 'Запрашиваемая страница не найдена.',
    'Unexpected error' => 'При обработке запроса возникла непредвиденная ошибка сервера.
                        Мы сохранили отчет и в ближайшее время начнем ее исправление.',
    'Redirect error' => 'Ошибка перехода',
    'Could not authorize' => 'Не получилось авторизовать вас как пользователя каталога. <br />
                        Пожалуйста, вернитесь на страницу каталога и попробуйте еще раз.',
    'Unknown error' => 'Неизвестная ошибка',
    'An unexpected server error' => 'При обработке запроса возникла непредвиденная ошибка.
                        Мы сохранили отчет и в ближайшее время начнем ее исправление.',
    'An unexpected server error occurred ' => 'При обработке запроса возникла непредвиденная ошибка.'
];