<?php
return [
    'Login verification' => 'Проверка входа',
    'Invalid code' => 'Неверный код.',
    'Enter otp code' => 'Для авторизации введите код из приложения генератора кодов.',
    'OTP code' => 'Код из приложения',
    'Need to login' => 'Для просмотра запрашиваемой страницы необходимо авторизоваться.',
    'Successfully out' => 'Вы успешно вышли из системы.',
    'Enter code from the image' => 'Введите код с картинки',
    'Need captcha' => 'Для входа в данный аккаунт необходимо ввести код с картинки.',
    'Confirm password' => 'Подтвердите пароль',
];