<?php
return [
    'Order actions' => 'Работа с заказами',
    'Active orders' => 'Активные заказы',
    'All orders' => 'Все заказы',
    'Order reminder first line' => 'Просмотр заказа будет доступен в течение 24 часов, по истечении этого времени он закроется автоматически',
    'Order reminder second line' => 'В случае возникновения проблем с заказом нажмите соответствующую кнопку и следуйте дальнейшим инструкциям',
    'Order reminder third line' => 'Если вы первый раз покупаете товары в даркнете, настоятельно рекомендуем ознакомиться с нашими памятками',
    'Order reminder forth line' => 'Для улучшения качества обслуживания обязательно закрывайте заказы и оставляйте отзывы после покупки',
    'No orders found' => 'Не найдено ни одного заказа.',
    'Status' => 'Статус',
    'View order' => 'Просмотр заказа №:order',
    'Your order is processing' => 'Ваш заказ собирается.',
    'Order will not be ready in' => 'Если через :humanTime заказ не будет готов, деньги будут возвращены автоматически.',
    'Place will be shown for' => 'Место будет показываться еще :humanTime.',
    'Place is hidden' => 'Место скрыто.',
    'Leave a review' => 'Оставить отзыв',
    'Problem with order' => 'Проблема с заказом?'
];